import numpy as np
import basis.robot_math as rm
'''
旋转参数 (欧拉角，单位：度):
  Alpha (绕X轴): 0.000°
  Beta  (绕Y轴): -0.370°
  Gamma (绕Z轴): -179.200°
--------------------
平移参数 (单位：米):
  X轴平移: 0.578700
  Y轴平移: -0.015500
  Z轴平移: 1.086000
'''

CONFIG = {
    # 'T_cam_to_world':  [[-0.999882, 0.013962, 0.006457, 0.578700],
    #                   [-0.013962, -0.999903, 0.000090, -0.015500],
    #                   [0.006458, 0.000000, 0.999979, 1.086000],
    #                   [0.000000, 0.000000, 0.000000, 1.000000]],
    'T_cam_to_world':  [[-0.999882, 0.013962, 0.006457, 0.575200],
                      [-0.013962, -0.999903, 0.000090, -0.015500],
                      [0.006458, 0.000000, 0.999979, 1.086000],
                      [0.000000, 0.000000, 0.000000, 1.000000]],
    'obj_name': 'M16_50',
    'shelf_name': 'M16hole',
    'target_name': 'M16table',
    'shelf_pos': np.array([0.5, 0, 0]),
    'shelf_rot': np.eye(3),
    'approach_dist': 0.07,
    'lift_dist': np.array([0, 0, 0.07]),  # 举起距离矢量
    # 机械臂相关参数
    'robot': {
        'high_speed': 0.8,
        'low_speed': 0.2,
        'acc': 1.0,
        'default_rot': np.eye(3),  # 默认姿态角
    },
    # 夹爪相关参数
    'gripper': {
        'high_speed': 100,
        'low_speed': 40,
        'force': 100,
        'open_width': 0.06,  # 可选
        'close_width': 0.03,  # 可选
    }

}
